<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

# Practice Lab: Selecting data in a Dataframe

Estimated time needed: **30** minutes

## Objectives

After completing this lab you will be able to:

*   Use Pandas Library to create DataFrame and Series
*   Locate data in the DataFrame using <code>loc()</code> and <code>iloc()</code> functions
*   Use slicing

**What is Pandas?**\
Pandas is a Python library used for working with data sets.\
It has functions for analyzing, cleaning, exploring, and manipulating data.

***Why Use Pandas?***\
Pandas allows us to analyze big data and make conclusions based on statistical theories.\

**What Can Pandas Do?**\
Pandas gives you answers about the data. Like: 

Is there a correlation between two or more columns?\
What is average value?\
Max value?\
Min value?

**Checking Pandas Version?**\

import pandas as pd\
print(pd.__version__)

### Exercise 1: Pandas: DataFrame and Series 

**Pandas** is a popular library for data analysis built on top of the Python programming language. Pandas generally provide two data structures for manipulating data, They are: 
 
* DataFrame
* Series

### DATAFRAME
is a two-dimensional data structure, i.e., data is aligned in rows and columns.

* A Pandas DataFrame will be created by loading the datasets from existing storage. 
* Storage can be SQL Database, CSV file, Excel file, etc. 
* It can also be created from the lists, dictionaries, and from a list of dictionaries.

In [7]:
# Example for DATAFRAME
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

myvar = pd.DataFrame(data)

print(myvar)

   calories  duration
0       420        50
1       380        40
2       390        45

Pandas use the **loc** attribute to return one or more specified row(s)

In [9]:
#refer to the row index:
print(myvar.loc[0])

calories    420
duration     50
Name: 0, dtype: int64

In [12]:
#refer to the row index:
print(myvar.loc[[0,1]])

   calories  duration
0       420        50
1       380        40

**Named indexes** With the index argument, you can name your own indexes.

In [14]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"]) #own index

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

Locate Named Indexes

In [15]:
#refer to the named index:
print(df.loc["day2"])

calories    380
duration     40
Name: day2, dtype: int64

### SERIES
it represents a one-dimensional array of indexed data.\
it is aligned in COLUMNS

It has two main components :
1. An array of actual data.
2. An associated array of indexes or data labels.

The index is used to access individual data values. You can also get a column of a dataframe as a **Series**. You can think of a Pandas series as a 1-D dataframe.\
**example:-**

In [3]:
#series example FOR an array of actual data
import pandas as pd
a = [1, 7, 2]
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

***Create Labels:-***\
Example:-
associated array of indexes or data labels

In [4]:
import pandas as pd
a = [1, 7, 2]
myvar = pd.Series(a, index = ["x", "y", "z"])
print(myvar)

x    1
y    7
z    2
dtype: int64

***Key/Value Objects as Series***\

Example:-\
Create a simple Pandas Series from a dictionary:

In [6]:
import pandas as pd
c = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(c)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [23]:
# let us import the Pandas Library
import pandas as pd

Once youâ€™ve imported pandas, you can then use the functions built in it to create and analyze data.

**In this practice lab, we will learn how to create a DataFrame out of a dictionary.**

Let us consider a dictionary 'x' with keys and values as shown below.

We then create a dataframe from the dictionary using the function pd.DataFrame(dict)

In [24]:
#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

We can see the direct correspondence between the table. The keys correspond to the column labels and the values or lists correspond to the rows.

#### Column Selection:

To select a column in Pandas DataFrame, we can either access the columns by calling them by their columns name. 

Let's Retrieve the data present in the <code>ID</code> column.

In [25]:
#Retrieving the "ID" column and assigning it to a variable x
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

Let's use the <code>type()</code> function and check the type of the variable.

In [26]:
#check the type of x
type(x)

pandas.core.frame.DataFrame

The output shows us that the type of the variable is a DataFrame object.

#### Access to multiple columns

Let us retrieve the data for <code>Department</code>, <code>Salary</code> and <code>ID</code> columns

In [27]:
#Retrieving the Department, Salary and ID columns and assigning it to a variable z

z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

### Try it yourself

##### Problem 1: Create a dataframe to display the result as below:

<center>
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/images/Student_data.png" width="300" alt="Student Data">
</center>

In [31]:
#write your code here
import pandas as pd
y = {'student':['david','samuel','terry','evan'],'age':[27,24,22,32],'country':['uk','canada','china','usa'],'course':['python','data structures','machine learning','web development'],'marks':[85,72,89,76]}
new = pd.DataFrame(y)
new

  student  age country            course  marks
0   david   27      uk            python     85
1  samuel   24  canada   data structures     72
2   terry   22   china  machine learning     89
3    evan   32     usa   web development     76

<details><summary>Click here for the solution</summary>

```python
a = {'Student':['David', 'Samuel', 'Terry', 'Evan'],
     'Age':['27', '24', '22', '32'],
     'Country':['UK', 'Canada', 'China', 'USA'],
     'Course':['Python','Data Structures','Machine Learning','Web Development'],
     'Marks':['85','72','89','76']}
df1 = pd.DataFrame(a)
df1
    
```

</details>

##### Problem 2: Retrieve the Marks column and assign it to a variable b

In [33]:
#write your code here
b = new[['marks']]
b

   marks
0     85
1     72
2     89
3     76

<details><summary>Click here for the solution</summary>

```python
b = df1[['Marks']]
b
    
```

</details>

##### Problem 3: Retrieve the Country and Course columns and assign it to a variable c

In [35]:
#write your code here
c = new[['country','course']]
c

  country            course
0      uk            python
1  canada   data structures
2   china  machine learning
3     usa   web development

<details><summary>Click here for the solution</summary>

```python
c = df1[['Country','Course']]
c
    
```

</details>

#### To view the column as a series, just use one bracket:

In [40]:
# Get the Student column as a series Object

n = new['student']
n

0     david
1    samuel
2     terry
3      evan
Name: student, dtype: object

In [ ]:
#check the type of x
type(x)

The output shows us that the type of the variable is a Series object.

### Exercise 2: <code>loc()</code> and <code>iloc()</code> functions

<code>loc()</code> is a label-based data selecting method which means that we have to pass the name of the row or column that we want to select. This method includes the last element of the range passed in it.

Simple syntax for your understanding: 

 - loc[row_label, column_label]

<code>iloc()</code> is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it.

Simple syntax for your understanding: 
   
 - iloc[row_index, column_index]

<h4 id="data">Let us see some examples on the same.</h4>

In [41]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'Rose'

In [42]:
# Access the value on the first row and the third column

df.iloc[0,2]

'Architect Group'

In [43]:
# Access the column using the name

df.loc[0, 'Salary']

np.int64(100000)

Let us create a new dataframe called 'df2' and assign 'df' to it. Now, let us set the "Name" column as an index column using the method set_index().

In [45]:
df2=df
df2=df2.set_index("Name")
df2

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [46]:
#To display the first 5 rows of new dataframe
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [50]:
df2.tail()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [54]:
#Now, let us access the column using the name
df2.loc['Jane','Salary']

np.int64(50000)

### Try it yourself

Use the <code>loc()</code> function,to get the Department of Jane in the newly created dataframe df2.

In [58]:
#write your code here
df2.loc['Jane','Department']

'Design Team'

<details><summary>Click here for the solution</summary>

```python
df2.loc['Jane', 'Department']
    
```

</details>

Use the <code>iloc()</code> function to get the Salary of Mary in the newly created dataframe df2.

In [59]:
#write your code here
df2.iloc[3,2]

np.int64(60000)

<details><summary>Click here for the solution</summary>

```python
df2.iloc[3,2]
    
```

</details>

### Exercise 3: Slicing

Slicing uses the [] operator to select a set of rows and/or columns from a DataFrame.

To slice out a set of rows, you use this syntax: data[start:stop], 

here the start represents the index from where to consider, and stop represents the index one step BEYOND the row you want to select. You can perform slicing using both the index and the name of the column.

> NOTE: When slicing in pandas, the start bound is included in the output.

So if you want to select rows 0, 1, and 2 your code would look like this: df.iloc[0:3].

It means you are telling Python to start at index 0 and select rows 0, 1, 2 up to but not including 3.

> NOTE: Labels must be found in the DataFrame or you will get a KeyError.

Indexing by labels(i.e. using <code>loc()</code>) differs from indexing by integers (i.e. using <code>iloc()</code>). With <code>loc()</code>, both the start bound and the stop bound are inclusive. When using <code>loc()</code>, integers can be used, but the integers refer to the index label and not the position. 

For example, using <code>loc()</code> and select 1:4 will get a different result than using <code>iloc()</code> to select rows 1:4.

<h4 id="data">We can also select a specific data value using a row and column location within the DataFrame and iloc indexing.

In [60]:
# let us do the slicing using old dataframe df

df.iloc[0:2, 0:3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [61]:
#let us do the slicing using loc() function on old dataframe df where index column is having labels as 0,1,2
df.loc[0:2,'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [62]:
#let us do the slicing using loc() function on new dataframe df2 where index column is Name having labels: Rose, John and Jane
df2.loc['Rose':'Jane', 'ID':'Department']

      ID       Department
Name
Rose   1  Architect Group
John   2   Software Group
Jane   3      Design Team

<h2 id="quiz">Try it yourself</h2>

using <code>loc()</code> function, do slicing on old dataframe df to retrieve the Name, ID and department of index column having labels as 2,3

In [64]:
# Write your code below and press Shift+Enter to execute
df.loc[2:3,'Name':'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure

<details><summary>Click here for the solution</summary>

```python
df.loc[2:3,'Name':'Department']
    
```

</details>

# Read CSV Files
CSV files contains plain text and is a well know format that can be read by everyone including Pandas.

Example

In [ ]:
#DO NOT RUN THIS
import pandas as pd

df = pd.read_csv('data.csv') # define another file

print(df.to_string()) 

#Tip: use to_string() to print the entire DataFrame.

In [ ]:
#DO NOT RUN THIS
#Print the DataFrame without the to_string() method:
--import pandas as pd

--df = pd.read_csv('data.csv')

--print(df)

### max_rows
You can check your system's maximum rows with the **pd.options.display.max_rows** statement.

In [ ]:
#DO NOT RUN THIS
import pandas as pd

pd.options.display.max_rows = 9999

df = pd.read_csv('data.csv')

print(df)

# Pandas Read JSON
Big data sets are often stored, or extracted as JSON.

EXAMPLE:-

In [ ]:
#DO NOT RUN THIS
import pandas as pd

df = pd.read_json('data.json')

print(df.to_string())

### Dictionary as JSON
Load a Python Dictionary into a DataFrame:

In [65]:
import pandas as pd

data = {
  "Duration":{
    "0":60,
    "1":60,
    "2":60,
    "3":45,
    "4":45,
    "5":60
  },
  "Pulse":{
    "0":110,
    "1":117,
    "2":103,
    "3":109,
    "4":117,
    "5":102
  },
  "Maxpulse":{
    "0":130,
    "1":145,
    "2":135,
    "3":175,
    "4":148,
    "5":127
  },
  "Calories":{
    "0":409,
    "1":479,
    "2":340,
    "3":282,
    "4":406,
    "5":300
  }
}

df = pd.DataFrame(data)

df # also you can use .to_string()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

# Pandas - Analyzing DataFrames

### Viewing the Data

The **head()** method returns the headers and a specified number of rows, starting from the top.

In [ ]:
# DO NOT RUN THIS
import pandas as pd

df = pd.read_csv('data.csv')

print(df.head(10))

#Note: if the number of rows is not specified, the head() method will return the top 5 rows.

There is also a tail() method for viewing the last rows of the DataFrame.

In [ ]:
#DO NOT RUN THIS
import pandas as pd

df = pd.read_csv('data.csv')

print(df.tail())

##Note: if the number of rows is not specified, the tail() method will return the top 5 rows.

The DataFrames object has a method called **info()**, that gives you more information about the data set.

In [66]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  6 non-null      int64
 1   Pulse     6 non-null      int64
 2   Maxpulse  6 non-null      int64
 3   Calories  6 non-null      int64
dtypes: int64(4)
memory usage: 240.0+ bytes
None

<h3 id="quiz">Congratulations, you have completed this lesson and the practice lab on Pandas</h3>

## Author(s):

[Appalabhaktula Hema](https://www.linkedin.com/in/hema-a-39002b128/)

## Change Log

| Date (YYYY-MM-DD) | Version | Changed By          | Change Description                 |
| ----------------- | ------- | ------------------- | ---------------------------------- |
| 2022-03-31        | 0.1     | Appalabhaktula Hema | Created initial version            |

<hr/>

## <h3 align="center"> Â© IBM Corporation 2022. All rights reserved. <h3/>